// 2023.03.13 2주차
// 13주차 공용어까지 진도 나갈 예정.

//#include <stdio.h>
//
//void main()
//{
//	/*int result;
//	result = 100 - 50;
//	printf("%d", result);*/
//
//	//printf("%d", 100 - 99);
//
//	printf("%d \n", 100 - 99); // \n 줄바꿈.
//}

// ctrl + shift + b >> 솔루션 빌드로 오류 확인 가능.
// ctrl + f5 >> 디버그 단축기 .exe 실행
// c언어의 엔터는 의미가 없다. ;가 붙어야 문장이 종료되기 때문.
// .sln 열면 프로젝트, 솔루션 열림.

// 이번 주 랩 숙제: 3/13 오후 11:59:59까지 제출
// 책 52페이지 1~7페이지 문제 풀이 후 제출. 아래한글, 워드, pdf로 작성해서 제출. 
// 소스 코드, 결과 화면 다 캡처해서 제출하면 된다.

// 미니 팀 프로젝트
// 미로 찾기, 벽돌 깨기, 테트리스 등 프로젝트 > 프로그램이 구동이 될 정도. 실행 파일이 제대로 실행되어야 함.
// 카피는 인정해도 소스 정확히 이해하고 있는지 확인. 발표해야 함.
// 발표 질문 제일 많이 한 팀 개별 2점, 1점씩 두 팀에 보너스 점수.
// 학기 2~3주 남겨 두고 발표 진행할 것. 지금부터 검색하고 준비해 둬야 함.

// 2주 휴강 예정. 3/25~4/8 오전 10시까지. 온라인 업로드 예정. 영상 듣는 시간 정해짐. 
// 시간적 여유가 있게끔 과제 제출해야 함.
// 돌아온 뒤 오프라인 수업 진행하고, 수업 외에 팀멘토링 진행할 예정.
// 단톡방에서 시간대 먼저 신청해서 시간 선점. 대략 30분 정도 예정. 넘어가게 되면 톡방에 공지.